import {Recipe} from './recipe.model'
import { EventEmitter } from '@angular/core';



export class Recipeservice{

    Recipeselected = new EventEmitter<Recipe>();
    

   private recipes: Recipe[] = [
        new Recipe('עוגת לוטוס','מדובר בעוגת גלידה ביתית. גלידה המבוססת על גבינת מסקרפונה משובחת, שטומנת בתוכה ומעליה קראנץ פריך של קורנפלקס לוטוס. העוגה הזו מוגשת הישר מהמקפיא. הגלידה שומרת על מרקם רך ומתמוסס והקורנפלקס נשאר קראנצי ומתפצפץ בפה. תשמחו לשמוע שמדובר בקינוח קל מאוד להכנה, מרשים ודורש מינימום של הכנות וטרחה.','http://www.metukimsheli.com/wp-content/uploads/2016/06/%D7%A2%D7%95%D7%92%D7%AA-%D7%9E%D7%A1%D7%A7%D7%A8%D7%A4%D7%95%D7%A0%D7%94-%D7%95%D7%9C%D7%95%D7%98%D7%95%D7%A1-%D7%A7%D7%A4%D7%95%D7%90%D7%942.jpg'),
        new Recipe('קנולי','משמעות המילה קנולו היא צינור קטן או קנולי ברבים, ובדומה לפסטה קנלוני – אותם צינורות פסטה שממלאים במלית גבינה או בשר, גם כאן, יוצרים מבצק מטוגן צינורות קטנים. את הצינורות ממלאים במלית מתוקה, לרוב מלית של גבינת ריקוטה. אני העדפתי את גבינת המסקרפונה העשירה אותה שילבתי עם מעט קפה ואגוזי לוז קצוצים.','http://www.metukimsheli.com/wp-content/uploads/2016/12/cannoli1.jpg'),
        new Recipe('אלפאחורס','אלפחורה היא עוגיית סנדוויץ׳ רכה ומתמוססת בפה עם מלית של ריבת חלב וציפוי קל של שבבי קוקוס, היא אופיינית לספרד ולדרום אמריקה ובעיקר לארגנטינה. מקור השם שלה הוא דווקא בשפה הערבית (אלפחיר) ומשמעותו  – ״המשובח״. אלפחורה מתייחס לעוגיה אחת ואילו אלפחורס מתייחס לרבים. בארץ התרגלנו כולנו לכנות גם עוגייה בודדה בצורת הרבים, אלפחורס.','http://www.metukimsheli.com/wp-content/uploads/2018/11/%D7%90%D7%9C%D7%A4%D7%97%D7%95%D7%A8%D7%A19.jpg'),
        new Recipe('עוגת מוס שוקולד עם פירות יער','מדובר בעוגת מוס שוקולד. אע״פ שהיא מבוססת על גבינה (גבינת מסקרפונה) אף אחד לא יינחש שזו למעשה עוגת גבינה, גם לא כל אלו שלא אוהבים עוגות גבינה (מי אתם?!!) או לחילופין אלו שלא אוהבים שילוב של גבינה ושוקולד. אין לכם מה לחשוש משני הטיפוסים המפוקפקים האלו, הם לא יבחינו שיש גבינה בסיפור הזה.','http://www.metukimsheli.com/wp-content/uploads/2018/10/-%D7%9E%D7%95%D7%A1-%D7%A9%D7%95%D7%A7%D7%95%D7%9C%D7%93-%D7%95%D7%A4%D7%98%D7%9C1-e1539321458531.jpg'),
        new Recipe('עוגת  אוראו ומסקרפונה','רק אם הייתם על הירח בשנה האחרונה סביר להניח שאתם לא מכירים את טרנד עוגות המספרים שסחף את הרשת בארץ ובעולם כולו. ולמקרה שבאמת הייתם על הירח ואתם לא יודעים במה מדובר: מדובר בעוגות חגיגיות במיוחד, בצורת אות או ספרה, עשויות מבצק פריך, מלאות בקרם עשיר ומעוטרות לרוב בפירות טריים או בגרסה המושחתת יותר – בממתקים ושוקולדים. גם אני נפלתי בטרנד והספקתי להכין השנה שתי עוגות כאלה: עוגת מספרים עם המספר 80 ליום הולדתו של אבא שלי (שיהיה בריא עד 120!) ועוגת מספרים עם המספר 18 ליום הולדת של האחיינית המתוקה שלי. העוגה קלה להכנה, ויחד עם זאת מרשימה מאוד וטעימה. אם תחשבו על זה, במידה והרכיבים של העוגה ובעיקר השכבות והמלית עשויות נכון, מדובר בעצם בסוג של טארט שבנוי קצת אחרת.','http://www.metukimsheli.com/wp-content/uploads/2018/08/-%D7%9E%D7%A1%D7%A4%D7%A8%D7%99%D7%9D-%D7%90%D7%95%D7%A8%D7%90%D7%95-%D7%95%D7%9E%D7%A1%D7%A7%D7%A8%D7%A4%D7%95%D7%A0%D7%946-e1534666387964.jpg'),
        new Recipe('טארט גבינה וממרח שוקולד','אם גם אתם כמוני קצת מבולבלים אני רוצה להציע לכם מתכון שמתאים לכל אלה שקצת פחות אוהבים עוגות גבינה (יש כאלו, מכירה אישית…) הטארט הבא משלב מלית של גבינה, אבל למעשה מה ששולט בו הוא הטעם המתוק של ממרח השוקולד שמככב בו.','http://www.metukimsheli.com/wp-content/uploads/2018/05/%D7%98%D7%90%D7%A8%D7%98-%D7%92%D7%91%D7%99%D7%A0%D7%94-%D7%95%D7%9E%D7%9E%D7%A8%D7%97-%D7%A9%D7%95%D7%A7%D7%95%D7%9C%D7%938.jpg'),
        new Recipe('עוגת גבינה, שוקולד לבן ופסיפלורה','עוגת גבינה עם שוקולד לבן, קוקוס ופסיפלורה. זו עוגה שיש בה גם ניגודים – גם עשירה מאוד, אבל גם קלילה ועדינה, גם מתוקה אבל גם חמצמצה. עוגה קלה מאוד להכנה, ללא אפייה וללא מייצבים מיותרים, אבל עדיין יציבה מאוד.','http://www.metukimsheli.com/wp-content/uploads/2017/05/-%D7%92%D7%91%D7%99%D7%A0%D7%94-%D7%A9%D7%95%D7%A7%D7%95%D7%9C%D7%93-%D7%9C%D7%91%D7%9F-%D7%95%D7%A4%D7%A1%D7%99%D7%A4%D7%9C%D7%95%D7%A8%D7%94-e1494421999304.jpg'),
        new Recipe('עוגת גבינה טים טם TIM TAM','טים טם, החטיף האוסטרלי, הוא לגמרי השטן. אם לכל חטיפי השוקולד והממתקים אני יכולה לעמוד בגבורה מבלי להניד עפעף, עם טים טם אני לגמרי אבודה. החטיף הזה ממכר ברמות הכי קשות, כי הוא פשוט מאוד מאוד טעים. גם אני, כמו רבים, הכרתי אותו לפניי מאה שנה בערך, בטיול של אחרי הצבא באוסטרליה, ארץ המוצא שלו. כבר אז הבנתי שמדובר בחבר אמת. לקח כמה שנים טובות עד שהתחילו לייבא אותו ארצה, ומאז בכל פעם שאני רואה אותו בסופרמרקט, למרות שאני זוכרת לו חסד נעורים, אני מתעלמת ממנו כאילו ומדובר באקס שלא ממש מתחשק לי להיתקל בו באקראי.','http://www.metukimsheli.com/wp-content/uploads/2017/05/%D7%A2%D7%95%D7%92%D7%AA-%D7%92%D7%91%D7%99%D7%A0%D7%94-%D7%98%D7%99%D7%9D-%D7%98%D7%9D.jpg'),
      ];

    getRecipe()
    {
        return this.recipes.slice();
    }


    
}